;=======================================================
; Carbines
;=======================================================

[Carbine_CV_Ghost X2WeaponTemplate]
FriendlyName="卡宾枪"
FriendlyNamePlural="卡宾枪"
BriefSummary="科技: 弹道\型号: 卡宾枪"
TacticalText="科技: 弹道\型号: 卡宾枪"
AbilityDescName="无托式"

[Carbine_MG_Ghost X2WeaponTemplate]
FriendlyName="磁力机关枪"
FriendlyNamePlural="磁力机关枪"
BriefSummary="科技:磁力\型号: 卡宾枪"
TacticalText="科技:磁力\型号: 卡宾枪"
AbilityDescName="无托式"

[Carbine_LS_Ghost X2WeaponTemplate]
FriendlyName="激光斯坦冲锋枪"
FriendlyNamePlural="激光斯坦冲锋枪"
BriefSummary="科技:激光\型号: 卡宾枪"
TacticalText="科技:激光\型号: 卡宾枪"
AbilityDescName="无托式"

[Carbine_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈淬火枪"
FriendlyNamePlural="线圈淬火枪"
BriefSummary="科技:线圈\型号: 卡宾枪"
TacticalText="科技:线圈\型号: 卡宾枪"
AbilityDescName="无托式"

[Carbine_BM_Ghost X2WeaponTemplate]
FriendlyName="电浆核能反应枪"
FriendlyNamePlural="电浆核能反应枪"
BriefSummary="科技:电浆\型号: 卡宾枪"
TacticalText="科技:电浆\型号: 卡宾枪"
AbilityDescName="无托式"

;=======================================================
; Strike Rifles
;=======================================================

[StrikeRifle_CV_Ghost X2WeaponTemplate]
FriendlyName="突击步枪"
FriendlyNamePlural="突击步枪"
BriefSummary="科技: 弹道\型号: 突击步枪"
TacticalText="科技: 弹道\型号: 突击步枪"
AbilityDescName="维克托步枪"

[StrikeRifle_MG_Ghost X2WeaponTemplate]
FriendlyName="磁力突击步枪"
FriendlyNamePlural="磁力突击步枪"
BriefSummary="科技: 磁力\型号: 突击步枪"
TacticalText="科技: 磁力\型号: 突击步枪"
AbilityDescName="维克托步枪"

[StrikeRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="激光突击步枪"
FriendlyNamePlural="激光突击步枪"
BriefSummary="科技: 激光\型号: 突击步枪"
TacticalText="科技: 激光\型号: 突击步枪"
AbilityDescName="维克托步枪"

[StrikeRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈突击步枪"
FriendlyNamePlural="线圈突击步枪"
BriefSummary="科技: 线圈\型号: 突击步枪"
TacticalText="科技: 线圈\型号: 突击步枪"
AbilityDescName="维克托步枪"

[StrikeRifle_BM_Ghost X2WeaponTemplate]
FriendlyName="电浆突击长矛"
FriendlyNamePlural="电浆突击长矛"
BriefSummary="科技: 电浆\型号: 突击步枪"
TacticalText="科技: 电浆\型号: 突击步枪"
AbilityDescName="维克托步枪"

;=======================================================
; Battle Rifles
;=======================================================

[BattleRifle_CV_Ghost X2WeaponTemplate]
FriendlyName="战斗步枪"
FriendlyNamePlural="战斗步枪"
BriefSummary="科技: 弹道\型号: 战斗步枪"
TacticalText="科技: 弹道\型号: 战斗步枪"
AbilityDescName="突击步枪"

[BattleRifle_MG_Ghost X2WeaponTemplate]
FriendlyName="磁力自动步枪"
FriendlyNamePlural="磁力自动步枪"
BriefSummary="科技: 磁力\型号: 战斗步枪"
TacticalText="科技: 磁力\型号: 战斗步枪"
AbilityDescName="突击步枪"

[BattleRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="激光脉冲发生器"
FriendlyNamePlural="激光脉冲发生器"
BriefSummary="科技: 激光\型号: 战斗步枪"
TacticalText="科技: 激光\型号: 战斗步枪"
AbilityDescName="突击步枪"

[BattleRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈自动步枪"
FriendlyNamePlural="线圈自动步枪"
BriefSummary="科技: 线圈\型号: 战斗步枪"
TacticalText="科技: 线圈\型号: 战斗步枪
AbilityDescName="突击步枪"

[BattleRifle_BM_Ghost X2WeaponTemplate]
FriendlyName="电浆轨道仪"
FriendlyNamePlural="电浆轨道仪"
BriefSummary="科技: 电浆\型号: 战斗步枪"
TacticalText="科技: 电浆\型号: 战斗步枪"
AbilityDescName="突击步枪"

;=======================================================
; Assault Rifles
;=======================================================

[AssaultRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="激光步枪"
FriendlyNamePlural="激光步枪"
BriefSummary="科技: 激光\型号: 突击步枪"
TacticalText="科技: 激光\型号: 突击步枪"
AbilityDescName="突击步枪"

[AssaultRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈步枪"
FriendlyNamePlural="线圈步枪"
BriefSummary="科技: 线圈\型号: 突击步枪"
TacticalText="科技: 线圈\型号: 突击步枪"
AbilityDescName="突击步枪"

;=======================================================
; Shotguns
;=======================================================

[Shotgun_LS_Ghost X2WeaponTemplate]
FriendlyName="激光散射枪"
FriendlyNamePlural="激光散射枪"
BriefSummary="科技: 激光\型号: 霰弹枪"
TacticalText="科技: 激光\型号: 霰弹枪"
AbilityDescName="霰弹枪"

[Shotgun_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈分裂枪"
FriendlyNamePlural="线圈分裂枪"
BriefSummary="科技: 线圈\型号: 霰弹枪"
TacticalText="科技: 线圈\型号: 霰弹枪"
AbilityDescName="霰弹枪"

;=======================================================
; Sniper Rifles
;=======================================================

[SniperRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="激光狙击长矛"
FriendlyNamePlural="激光狙击长矛"
BriefSummary="科技: 激光\型号: 狙击步枪"
TacticalText="科技: 激光\型号: 狙击步枪"
AbilityDescName="狙击步枪"

[SniperRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈长枪"
FriendlyNamePlural="线圈长枪"
BriefSummary="科技: 线圈\型号: 狙击步枪"
TacticalText="科技: 线圈\型号: 狙击步枪"
AbilityDescName="狙击步枪"

;=======================================================
; Cannons
;=======================================================

[Cannon_LS_Ghost X2WeaponTemplate]
FriendlyName="激光加农炮"
FriendlyNamePlural="激光加农炮"
BriefSummary="科技: 激光\型号: 加农炮"
TacticalText="科技: 激光\型号: 加农炮"
AbilityDescName="加农炮"

[Cannon_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈加农炮"
FriendlyNamePlural="线圈加农炮"
BriefSummary="科技: 线圈\型号: 加农炮"
TacticalText="科技: 线圈\型号: 加农炮"
AbilityDescName="加农炮"

;=======================================================
; Pistols
;=======================================================

[Pistol_LS_Ghost X2WeaponTemplate]
FriendlyName="激光手枪"
FriendlyNamePlural="激光手枪"
BriefSummary="科技: 激光\型号: 手枪"
TacticalText="科技: 激光\型号: 手枪"
UnknownUtilityCategory="手枪"
AbilityDescName="手枪"

[Pistol_CG_Ghost X2WeaponTemplate]
FriendlyName="线圈手枪"
FriendlyNamePlural="线圈手枪"
BriefSummary="科技: 线圈\型号: 手枪"
TacticalText="科技: 线圈\型号: 手枪"
UnknownUtilityCategory="手枪"
AbilityDescName="手枪"
